# Rows

## Get Started (Load a DataFrame)

In [1]:
import pandas as pd

In [2]:
filename = "Data_Applicants/aug_train.csv"
colsIwannaUse = ["enrollee_id", "city", "gender"]
df = pd.read_csv(filename, usecols = colsIwannaUse, nrows=50)
df.head(5)

   enrollee_id      city gender
0         8949  city_103   Male
1        29725   city_40   Male
2        11561   city_21    NaN
3        33241  city_115    NaN
4          666  city_162   Male

## Sort

In [3]:
sortCols = ["city", "gender"]
direction =["True", "False"]
df = df.sort_values(by = sortCols, ascending=direction)
df.head(5)

    enrollee_id      city  gender
28        21538  city_100    Male
48         4476  city_101    Male
22         6491  city_102     NaN
32         4324  city_103  Female
0          8949  city_103    Male

## Get row

In [7]:
### Get nth row
df = df.reset_index()
n = 5
row = df.iloc[[n]]
row

   level_0  index  enrollee_id      city gender
5        5    8.0        27107  city_103   Male

In [8]:
### Get every kth row
k = 17
rows = df.iloc[::k,:]
rows

    level_0  index  enrollee_id      city gender
0         0   28.0        21538  city_100   Male
17       17   15.0         6588  city_114   Male
34       34    2.0        11561   city_21    NaN

In [12]:
### Get kth row and some columns - does not exist in Python
# rows = df.iloc[::k, "city"] --> error

## Add row

In [9]:
df = df.append(row)
df.tail(5)

    level_0  index  enrollee_id      city gender
47       47   25.0        14505   city_67    NaN
48       48   39.0        24659   city_71   Male
49       49   49.0        25103   city_83   Male
50        8    NaN        27107  city_103   Male
5         5    8.0        27107  city_103   Male